---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarCoupler.GetCouplerQuantity
source: html/d9910074-138f-1d7a-3101-ed6a2ad3fc5b.htm
---
# Autodesk.Revit.DB.Structure.RebarCoupler.GetCouplerQuantity Method

Identifies the number of couplers in a set.

## Syntax (C#)
```csharp
public int GetCouplerQuantity()
```

## Returns
Returns the number of couplers in a set.